Repository: jiya-talreja/multi_language_detection
Catalog: backend/input/opus/en-hi.tmx
Source language: en
Languages: hi

source: He goes with his mother to Russia every year.
hi: वह हर साल अपनी माँ के साथ रूस जाता है।

source: He wanted to buy a small house in Romania.
hi: वह रोमानिया में एक छोटा सा घर खरीदना चाहता था।

source: He lived in Ukraine for many years.
hi: वह कई साल युक्रेन में रहा।

source: I heard that now, he works in Saudi Arabia.
hi: मैंने सुना है कि अब वह सउदी अरब में रहता है।

source: He learns Portuguese in Brazil.
hi: वह ब्राज़ील में पुर्त्तगाली सीखता है।

source: Europe is in crisis.
hi: युरोप संकट में है।

source: I am not a monster.
hi: मैं राक्षस नहीं हूँ।

source: Are these soldiers or monsters?
hi: ये सैनिक हैं या राक्षस?

source: We need soldiers, not monsters.
hi: हमें सैनिकों की ज़रूरत है, राक्षसों की नहीं।

source: How many states does India have?
hi: भारत में कितने राज्य हैं?

source: How many republics were there in the Soviet Union?
hi: सोवियत संघ में कितने गणराज्य हैं?

source: How many children does Tom have?
hi: टॉम के पास कितने बच्चे हैं?

source: How many articles are there on Wikipedia?
hi: विकिपीडिया पर कितने लेख हैं?

source: How many mosques are there in Istanbul?
hi: इस्तांबुल में कितनी मस्जिदें हैं?

source: How many independent countries are there in the world?
hi: दुनिया में कितने स्वतंत्र देश हैं?

source: I don't make mistakes.
hi: मैं गलतियां नहीं करता।

source: This kingdom needs a new king.
hi: इस राज्य को एक नये राजा की ज़रूरत है।

source: This country needs a new president.
hi: इस देश को एक नये राष्ट्रपति की ज़रूरत है।

source: This mosque needs a new imam.
hi: इस मस्जिद को एक नये इमाम की ज़रूरत है।

source: Islamabad is the capital of Pakistan.
hi: इस्लामाबाद पाकिस्तान की राजधानी है।

source: Wake them up.
hi: उन्हें जगाओ।

source: When does she play tennis?
hi: वह टेनिस कब खेलती है?

source: They translated the novel from Russian into Armenian.
hi: उन्होंने वह उपन्यास का रूसी से आर्मीनियाई में भाषांतर किया।

source: What was he doing there?
hi: वह वहाँ क्या कर रहा था?

source: Is the phone ringing?
hi: फ़ोन बज रहा है क्या?

source: Fire!
hi: आग!

source: Tom always peels apples before he eats them.
hi: टॉम हमेशा सेब खाने के पहले उनकी छाल उतारता है।

source: Why aren't you eating?
hi: तुम खा क्यों नहीं रहे?

source: Please don't touch me.
hi: कृपया मुझे मत छुहें.

source: Does Arnold Schwarzenegger still know German?
hi: क्या आर्नोल्ड श्वार्झनेगर को अब भी जर्मन आती है?

source: That was my finger.
hi: वह मेरी उँगली थी।

source: I saw this movie a very long time ago.
hi: मैंने यह चलचित्र बहुत समय पहले देखा था.

source: What did Galileo see?
hi: गैलीलियो ने क्या देखा?

source: I'm not a monster.
hi: मैं राक्षस नहीं हूँ।

source: When did you find out?
hi: तुम्हें कब पता चला?

source: Why are you looking down?
hi: नीचे क्यों देख रहे हो?

source: These texts were written in Hebrew, not in Aramaic.
hi: यह पाठ्य इब्रानी में लिखे थे, आरामाईक में नहीं।

source: I want milk.
hi: मुझे दूध चाहिए।

source: Where's Tom going to sleep?
hi: टॉम कहाँ सोने वाला है?

source: Tom looks scared.
hi: टॉम डरा हुआ लगता है।

source: That's mine.
hi: वह मेरा है।

source: I'd like to talk to you.
hi: मुझे तुमसे बात करनी है।

source: I see a giraffe.
hi: मुझे एक जिराफ़ दिखाई दे रहा है।

source: I didn't see you.
hi: मैने तुम्हें देखा नही।

source: Everyone looks uncomfortable.
hi: सभी बेआराम लगते हैं।

source: Do you trust me?
hi: क्या आपको मेरे पर भरोसा है?

source: Give me a kiss.
hi: मुझे एक किस दो।

source: Tom's dog's name is Cookie.
hi: टॉम के कुत्ते का नाम कुकी है।

source: You should eat.
hi: तुम्हें खाना चाहिए।

source: Wake up.
hi: उठ।

source: Hug me.
hi: मेरे गले लगो।

source: It was very small.
hi: बहुत छोटा था।

source: She doesn't want kids.
hi: उसे बच्चे नहीं चाहिए।

source: My husband is lazy.
hi: मेरे पती आलसी हैं।

source: He married a farmer's daughter.
hi: उसने एक किसान के बेटी से शादी की।

source: "How did you two meet?" "It's a long story."
hi: "तुम दोनों मिले कैसे?" "लंबी कहानी है।"

source: Stay here with Tom.
hi: यहां टॉम के साथ रहो।

source: Delete his name from the list.
hi: सूची से उसका नाम मिटाओ।

source: She wants to live in the city.
hi: वह शहर में रहना चाहती है।

source: I don't like this candy.
hi: यह कैंडी मुझे पसंद नहीं हैं।

source: The capital of France is Paris.
hi: फ़्रांस की राजधानी पैरीस है।

source: Tom looked at Mary.
hi: टॉम ने मॅरी को देखा।

source: Tom is still asleep.
hi: टॉम अभी भी सोया हुआ है।

source: Tom is a guest.
hi: टॉम मेहमान है।

source: Tom doesn't let anyone touch him.
hi: टॉम किसी को उसे छूने नहीं देता।

source: Tom didn't tell me.
hi: टॉम ने मुझे बताया नहीं।

source: Leave your umbrella at the front door.
hi: अपने छाते को सामने वाले द्वार छोड़ दो।

source: This is a beautiful book.
hi: यह खूबसूरत किताब है।

source: This isn't right.
hi: यह सही नहीं है।

source: I have to go home already.
hi: मुझे अभी घर जाना है.

source: Is this harmful to my health?
hi: क्या यह मेरे स्वास्थ्य के लिये हानिकारक है?

source: I can't accept your gift.
hi: मैं यह तुम्हारा उपहार स्वीकार नहीं कर सकता।

source: Look! There is a cat in the kitchen.
hi: देखिए! रसोईघर में एक बिल्ली है.

source: This was a winter evening.
hi: यह एक सर्दियों की शाम थी.

source: Tom won't be eating anything else.
hi: टॉम और कुछ नहीं खायेगा.

source: I'm not Uyghur. I'm Russian.
hi: मैं उइघुर नहीं हूँ। मैं रूसी हूँ।

source: The sun will shine again soon.
hi: सूरज जल्दी ही फिर से चमकेगा।

source: You look fine.
hi: तुम ठीक लग रहे हो।

source: I can't give you that information.
hi: मैं तुम्हें वह जानकारी नहीं दे सकता।

source: Having unprotected sex is dangerous.
hi: असुरक्षित सेक्स खतरनाक होता है।

source: I am from Portugal.
hi: मैं पुर्तगाल से हूँ।

source: He can't sing.
hi: उसे गाना नहीं आता।

source: So that's what it's all about!
hi: तो यह बात है!

source: In Canada they speak English and French.
hi: कनाडा में अंग्रेज़ी और फ़्रांसीसी बोली जातीं है।

source: Does Tom know?
hi: टॉम को पता है?

source: Can you move your legs?
hi: क्या आप अपने पैर हिला सकते हैं?

source: Can you help us?
hi: क्या तुम हमारी मदद कर सकते हो?

source: Why did Tom do this?
hi: टॉम ने ऐसा क्यों किया?

source: Whose bed is that?
hi: वह किसका बिस्तर है?

source: Who's Tom?
hi: टॉम कौन है?

source: Who's Tom talking to?
hi: टॉम किससे बात कर रहा है?

source: Who has the gun?
hi: बंदूक किसके पास है?

source: Which one do you want?
hi: कौनसा चाहिए?

source: Where's my tea?
hi: मेरी चाय कहाँ है?

source: When is Tom coming?
hi: टॉम कब आ रहा है?

source: When did Tom say that?
hi: टॉम ने वैसा कब कहा?

source: What happened next?
hi: उसके बाद क्या हुआ?

source: What are you trying to say?
hi: तुम क्या कहने की कोशिश कर रहे हो?

source: Were you two close?
hi: क्या तुम दोनों पास ही थे?

source: Is that Tom?
hi: वह टॉम है?

source: I didn't ask for this.
hi: मैनें यह नहीं मांगा था।

source: I don't have anything else.
hi: मेरे पास और कुछ नहीं है।

source: I got into trouble.
hi: मैं मुसीबत में पड़ गया।

source: I have back problems.
hi: मुझे पीठ की तकलीफ है I

source: I heard a noise.
hi: मुझे कोई आवाज़ सुनाई दी।

source: I just want you to be happy.
hi: मैं बस चाहता हूं कि तुम ख़ुश रहो।

source: I think Mary likes me.
hi: मुझे लगता है मैरी मुझे पसंद करती है।

source: I want to see Tom.
hi: मुझें टॉम को देखना है।

source: I'd help you if I could.
hi: अगर हो सकता तो मैं तुम्हारी मदद करता।

source: I'm just saying we can't trust Tom.
hi: मैं बस इतना कह रहा हूं के हम टॉम पर भरोसा नहीं कर सकते।

source: What do you like about him?
hi: तुम्हें उसके बारे में क्या अच्छा लगता है?

source: We're not soldiers.
hi: हम सैनिक नहीं हैं।

source: We'll call you.
hi: हम आपको फ़ोन करेंगे।

source: We want to talk to you.
hi: हम तुम से बात करना चाहते हैं।

source: We want to talk to Tom.
hi: हम टॉम से बात करना चाहते हैं।

source: We understand.
hi: हम समझते हैं।

source: We understand each other.
hi: हम एक-दूसरे को समझते हैं।

source: We tried to save Tom.
hi: हमने टॉम को बचाने की कोशिश की।

source: We have some new products we'd like you to see.
hi: आपको कुछ नए प्रॉडक्ट्स दिखाना चाहते हैं।

source: You don't have to go to school today.
hi: तुम्हे आज पाठशाला जाने की ज़रूरत नहीं है।

source: He plays World of Warcraft.
hi: वह वर्ल्ड ऑफ़ वॉरक्राफ़्ट खेलता है।

source: She plays World of Warcraft.
hi: वह लड़की वर्ल्ड ऑफ वॉरक्राफ्ट खेलती है।

source: It's a weapon.
hi: यह एक हथियार है।

source: You've got to stop Tom.
hi: तुम्हे टॉम को रोकना ही होगा।

source: You're smarter than Tom.
hi: तुम टॉम से ज़्यादा होशियार हो।

source: You're smarter than Tom is.
hi: तुम टॉम से ज़्यादा होशियार हो।

source: You're really funny.
hi: तुम सचमुच मज़ाकिया हो।

source: You betrayed me.
hi: तुमने मुझे धोका दिया।

source: There is a crowd of women around Tom.
hi: टॉम के भीतर औरतों की भीड़ है।

source: Someone told me Mary left her husband.
hi: किसी ने मुझे बताया के मेरी ने अपने पती को छोड़ दिया।

source: Zeus is angry.
hi: ज़ेउस क्रोधित है।

source: I have a gay neighbor.
hi: मेरा एक गे पड़ोसी है।

source: She got what she wanted.
hi: उसे जो चाहिए था वह उसे मिल गया।

source: Mom, Mary's hitting me!
hi: माँ, मैरी मुझे मार रही है!

source: We are going to Germany tomorrow.
hi: हम कल जर्मनी जाने वाले हैं।

source: He's very lonely.
hi: वह बहुत अकेला है.

source: Listen.
hi: सुनो।

source: What a beautiful scene!
hi: क्या सुंदर नज़ारा है!

source: He likes Indian food.
hi: उसे भारतीय खाना पसंद है।

source: He doesn't remember anything.
hi: उसे कुछ भी याद नहीं।

source: I refuse to answer.
hi: मैं जवाब देने से इन्कार करता हूं।

source: The girl who works at that bakery is cute.
hi: बेकरी में काम करनेवाली वह लड़की प्यारी है।

source: Tom wanted to spend some time alone with Mary.
hi: टॉम थोडा समय मैरी के साथ अकेला बिताना चाहता था।

source: There are mosquitoes even in Greece.
hi: मच्छर तो यूनान में भी है।

source: His wife was mad.
hi: उसकी बीवी पागल थी.

source: You look like your dad.
hi: तुम तुम्हारे पापा की तरह दिखती हो।

source: Let me go.
hi: जाने दीजिए मुझे।

source: Don't forget rule no. 72.
hi: नियम क्र. ७२ मत भूलना.

source: I thought Tom would bring us something to eat.
hi: मैंने सोचा टॉम हमारे खाने के लिए कुछ लाएगा.

source: I thought Tom would be different.
hi: मुझे लगा था टॉम अलग होगा।

source: I thought Tom wouldn't like Mary.
hi: मुझे लगा था टॉम को मैरी पसंद नहीं आएगी।

source: Stop! You're making him cry.
hi: बस करो! तुम उसे रुला रहे हो।

source: Don't come in! I'm naked.
hi: अंदर मत आओ! मैं नंगा हूँ।

source: I consider making mistakes an important part of the learning process.
hi: मैं मानता हूं कि गलतियां करना यह सीखने की प्रक्रिया का एक महत्त्वपूर्ण हिस्सा होता है।

source: I can't believe it's that simple.
hi: इतना आसान है कि मुझे यकीन ही नहीं हो रहा।

source: Tom can't believe Mary.
hi: टॉम को मैरी पर विश्वास नहीं हो रहा।

source: I can't even do that.
hi: मैं तो वह भी नहीं कर सकता।

source: We can't find Tom anywhere.
hi: हमें टॉम कहीं भी नहीं मिल रहा।

source: I can't go to the mall.
hi: मैं मॉल नहीं जा सकता।

source: I can't hear a word.
hi: मुझे एक शब्द सुनाई नहीं दे रहा।

source: I can't help.
hi: मैं मदद नहीं कर सकता।

source: Leave it.
hi: छोड़।

source: You can't let that come between you and Tom.
hi: तुम उस बात को तुम्हारे और टॉम के बीच आने नहीं दे सकते।

source: I can't let you leave.
hi: आपको जाने नहीं दे सकता हूँ।

source: We can't lie to Tom.
hi: हम टॉम से झूठ नहीं बोल सकते।

source: I can't really talk about it.
hi: मैं उस बारे में कुछ बोल नहीं सकता।

source: I can't remember anything about that night.
hi: मुझे उस रात के बारे में कुछ याद नहीं.

source: I can't wait another week.
hi: मैं और एक हफ़्ता नहीं रुक सकता।

source: We can't waste any more time.
hi: हम और वक्त बरबाद नहीं कर सकते।

source: It's a strip club for women.
hi: महिलाओं के लिये स्ट्रिप क्लब है।

source: I only care about Tom.
hi: मुझे बस टॉम की चिंता है।

source: I only drink water.
hi: मैं बस पानी पीता हूँ।

source: Where's the rest of the money?
hi: बाकी का पैसा कहाँ है?

source: I try to think.
hi: मैं सोचने की कोशिश करता हूँ।

source: I hate you with all of my heart.
hi: मैं तुम से पूरे दिल से नफ़रत करता हूं।

source: I thought I was alone here.
hi: मुझे लगा मैं यहां अकेला हूं।

source: I thought Tom was your enemy.
hi: मुझे लगा टॉम तुम्हारा दुश्मन है।

source: I thought you two would have a lot in common.
hi: मैं सोचता था कि तुम दोनो में बहुत सी बातें एक दुसरे से मिलती जुलती होगी।

source: I thought you were a man of honor.
hi: मैं सोचता था कि तुम एक इज्जतदार आदमी हो।

source: I thought you were going steady with Tom.
hi: मैं समझता था कि तुम्हारी और टॅाम की जोड़ी अच्छी चल रही थी।

source: I am not writing in English. This language is Russian.
hi: मैं अंग्रेज़ी में नहीं लिख रहा। यह भाषा रूसी है।

source: Why am I studying Icelandic?
hi: मैं आइसलॅन्डिक क्यों सीख रही हूं?

source: It's a large one.
hi: बड़ा वाला है।

source: She writes about Sri Lanka.
hi: वह श्रीलंका के बारे में लिखती है।

source: Can this car go any faster?
hi: क्या यह गाड़ी और तेज़ जा सकती है?

source: Attack!
hi: आक्रमण!

source: I kissed her on the forehead.
hi: मैंने उसे माथे पर किस किया।

source: Can I speak to Tom?
hi: क्या मैं टॉम से बात कर सकता हूँ?

source: My brother works in France.
hi: मेरा भाई फ़्रांस में काम करता है।

source: I'm your sister.
hi: मैं तुम्हारी बहन हूँ।

source: How's the water?
hi: पानी कैसा है?

source: The water was cold.
hi: पानी ठंडा था।

source: The water is cold.
hi: पानी ठंडा है।

source: Would you like tea or something?
hi: चाय-वाय कुछ लोगे?

source: Oh, here comes Chris.
hi: लो, क्रिस आ गया।

source: You often ask questions I can't answer.
hi: तुम अकसर ऐसे सवाल पूछते हो जिनका मैं जवाब नहीं दे सकता।

source: Do you like sweet tea?
hi: तुम्हें मीठी चाय पसंद है?

source: Bangladesh became independent in 1971.
hi: बांग्लादेश १९७१ में स्वतंत्र हुआ।

source: The older daughter wants to be British.
hi: बड़े बेटी को ब्रिटिश बनना है।

source: She's ready now.
hi: वह अब तैयार है।

source: Tom died.
hi: टॉम मर गया।

source: Who won?
hi: कौन जीता?

source: Tom won.
hi: टॉम जीत गया।

source: I won!
hi: मैं जीत गया!

source: Let's put this near the door.
hi: इसे दरवाज़े के पास रख देते हैं।

source: Let's do something together.
hi: चलो कुछ एक साथ करें।

source: Let's play this game again.
hi: चलो यह खेल फिर से खेलते हैं।

source: Let's just go to sleep.
hi: बस सो जाते हैं।

source: Let's start with this.
hi: इससे शुरुआत करते हैं।

source: Let's start with that.
hi: उससे शुरुआत करते हैं।

source: Let's play a new game.
hi: नया खेल खेलते हैं।

source: Let's just meet here.
hi: यहीं मिल लेते हैं।

source: Let's start at 2:30.
hi: २:३० बजे शुरू करते हैं।

source: Let's just eat here.
hi: चलो यहीं खा लेते हैं।

source: Let's finish it now.
hi: चलो अभी खत्म कर देते हैं।

source: Let's do this right.
hi: ठीक से करते हैं।

source: Let's do it tonight.
hi: आज रात करते हैं।

source: Let's do it for Tom.
hi: टॉम के लिये करते हैं।

source: Let's just say yes.
hi: बस हाँ कह देते हैं।

source: Let's go home, Tom.
hi: चलो घर चलते हैं, टॉम।

source: Let's get you home.
hi: चलो तुम्हें घर पहुँचाते हैं।

source: Let's begin again.
hi: फिर से शुरुआत करते हैं।

source: Let's go ask Tom.
hi: टॉम से पूछते हैं।

source: Let's follow Tom.
hi: टॉम का पीछा करते हैं।

source: Let's go inside.
hi: अंदर चलते हैं।

source: Let's find Tom.
hi: टॉम को ढूंढते हैं।

source: Let's call Tom.
hi: टॉम को बुलाते हैं।

source: Let's talk.
hi: चलो बात करते हैं।

source: I love my mom.
hi: मैं अपनी मां से प्यार करता हूं।

source: I want this.
hi: मुझे यह चाहिए।

source: We want Tom.
hi: हमें टॉम चाहिए।

source: I want to win.
hi: मैं जीतना चाहती हूँ।

source: I wanted this.
hi: मुझे यह चाहिए था।

source: We wanted Tom.
hi: हमें टॉम चाहिए था।

source: Who wants tea?
hi: चाय किसे चाहिए?

source: Who wants this?
hi: यह किसे चाहिए?

source: Who wants jello?
hi: जेलो किसे चाहिए?

source: Who wants to go?
hi: कौन जाना चाहता है?

source: I don't want tea.
hi: मुझे चाय नहीं चाहिए।

source: Tom wanted a job.
hi: टॉम को एक नौकरी चाहिए थी।

source: Tom wants to run.
hi: टॉम भागना चाहता है।

source: We only want you.
hi: हमें बस तुम चाहिए।

source: They want to talk.
hi: वे बात करना चाहते हैं।

source: I want to go there.
hi: मैं वहाँ जाना चाहता हूँ।

source: I want to help you.
hi: मैं तुम्हारी मदद करना चाहता हूँ।

source: Tom wants our help.
hi: टॉम को हमारी मदद चाहिए।

source: Who wants this one?
hi: यह वाला किसे चाहिए?

source: Who wants to fight?
hi: कौन लड़ना चाहता है?

source: Why do you want it?
hi: तुम्हें क्यों चाहिए?

source: We want to meet Tom.
hi: हम टॉम से मिलना चाहते हैं।

source: Tom wants to marry me.
hi: टॉम मुझसे शादी करना चाहता है।

source: I don't want your gold.
hi: मुझे तुम्हारा सोना नहीं चाहिए।

source: We all want to go home.
hi: हम सब घर जाना चाहते हैं।

source: Do you want to see this?
hi: क्या तुम यह देखना चाहते हो?

source: Does Tom want to see me?
hi: क्या टॉम मुझे देखना चाहता है?

source: I don't want your stuff.
hi: मुझे तुम्हारा सामान नहीं चाहिए।

source: What did you want to say?
hi: तुम क्या कहना चाहते थे?

source: You don't want to go there.
hi: तुम वहाँ नहीं जाना चाहते।

source: We just want to talk to Tom.
hi: हम बस टॉम से बात करना चाहते हैं।

source: I don't want to go on my own.
hi: मैं अकेले जाना नहीं चाहता।

source: I just want to talk a minute.
hi: मैं बस आपसे एक मिनट बात करना चाहता हूं।

source: I want Tom to know the truth.
hi: मैं चाहता हूं के टॉम सच जाने।

source: I don't want to lose you, Tom.
hi: मैं तुम्हें खोना नहीं चाहता, टॉम।

source: What is it you want to ask me?
hi: तुम मुझसे क्या पूछना चाहते हो?

source: I don't want to argue with you.
hi: मैं तुम से बहस करना नहीं चाहता।

source: Tom and Mary want to talk to me.
hi: टॉम और मैरी मुझसे बात करना चाहते हैं।

source: I don't want to do this with you.
hi: मैं तुम्हारे साथ ऐसा नहीं करना चाहती.

source: I want you to come to my wedding.
hi: मेरी इच्छा है तुम मेरे विवाह पर आओ.

source: I want you to take this with you.
hi: मैं चाहता हूँ के तुम यह अपने साथ ले जाओ.

source: I wanted to get my mind off work.
hi: मैं अपने काम से ध्यान हटाना चाहता था।

source: Is there anywhere you want to go?
hi: ऐसी कोई जगह है जहां आप जाना चाहते हो?

source: There is one thing I want to ask.
hi: मुझे एक बात पूछनी है।

source: Tell Tom that I want to marry him.
hi: टॉम से कहो मैं उससे शादी करना चाहती हूँ।

source: They want us to come in right away.
hi: वह चाहते हैं हम अभी इसी समय अन्दर आ जायें.

source: That night was very cold.
hi: वह रात बहुत ठंडी थी।

source: I don't want to talk to you anymore.
hi: मैं आपके साथ अब और बात नहीं करना चाहता.

source: You wanted me to get a job, so I did.
hi: तुम चाहते थे मैं कोई काम ढूँढूं, इसलिए मैंने ढून्ढ लिया.

source: She praised her son.
hi: उसने अपने पुत्र की प्रशंसा की.

source: I want to get my mind off work.
hi: मैं अपने काम से ध्यान हटाना चाहता हूँ।

source: She's playing Super Mario Bros.
hi: वह सुपर मारिओ ब्रदर्स खेल रही है।

source: Have you played The Legend of Zelda?
hi: क्या तुमने 'द लेजंड आफ ज़ेल्डा' खेला है?

source: It's not impossible.
hi: नामुमकिन नहीं है।

source: I can't see through walls.
hi: मैं दीवारों के पार नहीं देख सकता।

source: Superman can see through walls.
hi: सुपरमैन दीवारों के पार देख सकता है।

source: She says that she can see through walls.
hi: वह कहती है कि वह दीवारों के पार देख सकती है।

source: The cat is stuck in the tree.
hi: वह बिल्ली पेढ पर अटक गयी है।

source: Can Superman also see through clothes?
hi: क्या सुपरमैन कपडों के पार भी देख सकता है?

source: This scanner can see through clothes.
hi: यह स्कैनर कपडों के पार भी देख सकता है।

source: I have to buy a new scanner.
hi: मुझे नया स्कैनर खरीदना है।

source: You can't stop progress.
hi: तुम प्रगति को रोक नहीं सकते।

source: Can I try it?
hi: क्या मैं कोशिश करूं?

source: He's allergic to cats.
hi: उसे बिल्लियों से ऐलर्जी है।

source: She's allergic to cats.
hi: उसे बिल्लियों से ऐलर्जी है।

source: I don't work here.
hi: मैं यहाँ काम नहीं करता।

source: I'm only doing this for your own good.
hi: मैं यह बस तुम्हारे ही भले के लिये कर रहा हूं।

source: I only did it for your own good.
hi: मैने यह बस तुम्हारे ही भले के लिये किया।

source: This doesn't mean anything.
hi: इसका कोई मतलब नही।

source: He wants to marry my daughter.
hi: वह मेरी बेटी से शादी करना चाहता है।

source: He is walking.
hi: वह चल रहा है।

source: I will give you five dollars.
hi: मैं आपको पाँच डौलर दूँगी।

source: She likes reading the most.
hi: उसे सबसे ज़्यादा पढ़ना पसंद है।

source: They will kill me.
hi: वे लोग मुझे मार डालेंगे।

source: That is my house.
hi: वह घर मेरा है।

source: There is a concert next sunday.
hi: अगले रविवार कॉन्सर्ट है।

source: Two is a couple, three is a crowd.
hi: दो व्यक्ति जोड़ा हैं, तीन भीड़ है.

source: I don't want to stay here anymore, Tom.
hi: मुझे यहां और नहीं रहना है, टॉम।

source: I want a cup of coffee and I want it now.
hi: मुझे एक कप काफ़ी चाहिए और वह भी अभी के अभी चाहिए।

source: Why do you want to be alone all the time?
hi: तुम हमेशा अकेले क्यों रहना चाहते हो?

source: The Chinese don't know that I'm not human.
hi: चाईनिज नहीं जानते कि मैं मानव नहीं हुँ।

source: She's nice to me.
hi: उसका मेरे प्रति व्यवहार अच्छा है.

source: There's no wind here.
hi: यहां हवा नहीं है।

source: I don't want to quit.
hi: मैं छोड़ना नहीं चाहता।

source: I want to say thank you.
hi: मैं शुक्रिया अदा करना चाहता हूं।

source: I want to make Tom happy.
hi: मैं टॉम को ख़ुश करना चाहता हूं।

source: Tom, I want to talk to you.
hi: टॉम, मुझे तुमसे बात करनी है।

source: I want to speak to you about Tom.
hi: मैं तुम से टॉम के बारे में बात करना चाहता हूँ।

source: Tom wants to tell you about Mary.
hi: टॉम तुम्हें मॅरी के बारे में कुछ बताना चाहता है।

source: Tom wants to know why you didn't call him back.
hi: टॉम पूछ रहा है कि तुमने उसे कॉल बैक क्यों नहीं किया।

source: There is a bottle in the fridge.
hi: फ्रिज में एक बोतल है।

source: Make it quick.
hi: जल्दी कीजिए।

source: My brother hates me.
hi: मेरा भाई मुझ से नफ़रत करता है।

source: I feel that it will rain.
hi: लगता है बारिश होगी।

source: I live in Osaka.
hi: मैं ओसाका में रहता हूँ।

source: I'm not happy here.
hi: मैं यहाँ खुश नहीं हूँ।

source: They are all happy.
hi: वे सब खुश हैं।

source: They seem so happy.
hi: वे कितने खुश लगते हैं।

source: Tom seemed so happy.
hi: टॉम कितना खुश लग रहा था।

source: People like you are never happy.
hi: तुम्हारे जैसे लोग कभी भी खुश नहीं होते।

source: She is our neighbor.
hi: वह हमारी पड़ोसी है।

source: Tom's dream is coming true.
hi: टॉम का सपना सच हो रहा है।

source: This is just like a dream.
hi: यह तो बिलकुल किसी सपने की तरह है।

source: What a beautiful story!
hi: क्या खूबसूरत कहानी है!

source: That's so beautiful.
hi: वह कितना सुंदर है।

source: It was a beautiful speech.
hi: सुंदर भाषण था।

source: Natural mineral water contains calcium, magnesium, sodium, potassium as well as nitrate.
hi: प्राकृतिक खनिज पानी में समाहित है चूर्णातु, भ्राजातु, क्षारातु, दहातु, व भूयीयों भी।

source: Rachel Corrie was an American who was killed in Gaza.
hi: रॅशेल कॉरी एक अमरीकी ती जो गाज़ा में मारी गयी थीं।

source: That's child's play.
hi: वह तो बच्चों का खेल है।

source: Eat something.
hi: कुछ तो खाओ।

source: Stay with us tonight and find a hotel tomorrow.
hi: आज रात हमारे साथ रहो, कल कोई होटल दूंढ लेना.

source: Is your car black?
hi: क्या आपकी गाड़ी काली है?

source: Sri Lanka is a beautiful island.
hi: श्रीलंका एक सुंदर द्वीप है।

source: Iran desires to befriend the world.
hi: ईरान विश्व के साथ मित्रता करने का इछुक है।

source: There are many webs within the World Wide Web. Rings are obvious. Less apparent are webs of server farms, which are in effect distributed Web sites.
hi: वर्ल्ड वाइड वेब में कई जाल हैं. उनके चक्र साफ़ नज़र आते हैं. सर्वर फार्मों के जाल उनसे कम दृष्ट्मान हैं, जो के असलियत में विस्तृत वेब साईट हैं.

source: Thanks.
hi: धन्यवाद।

source: I'm to blame.
hi: दोष मेरा है।

source: Who's to blame?
hi: दोष किसका है?

source: You're not to blame.
hi: दोष तुम्हारा नहीं है।

source: That computer has a quad-core processor.
hi: उस कंप्यूटर में एक क्वाड-कोर प्रोसेसर है।

source: This phone has a quad-core processor.
hi: इस फ़ोन में एक क्वाड-कोर प्रोसेसर है।
